export const RU = {
    welcome: "Приветствую!",
    home: "Главная",
    skills: "Навыки",
    project: "Проекты",
    testimony: "Отзывы",
    contacts: "Контакты",
    iam: "Я",
    spec1: "Full Stack разработчик.",
    spec2: "Full Stack инженер.",
    spec3: "Разработчик программного обеспечения.",
    spec4: "JAVA разработчик.",
    spec5: "Backend разработчик.",
    spec6: "Веб-разработчик.",
    spec7: "Frontend разработчик.",
    spec8: "React разработчик.",
    slogan: "В настоящее время я доступен для трудоустройства",
    redirect: "Перенаправление через",
    seconds: "секунд...",
    hire: "Нанять меня",
    myskills: "Мои навыки",
    htmlDescription:
        "Язык разметки для создания веб-страниц и приложений, обеспечивающий структуру и содержание веб-сайтов.",
    cssDescription:
        "Язык стилей, используемый для управления представлением и макетом HTML-документов, делая веб-сайты визуально привлекательными.",
    jsDescription:
        "Язык программирования, который позволяет создавать интерактивные веб-страницы и является важной частью веб-приложений.",
    typeScriptDescription:
        "Надстройка JavaScript, которая добавляет статическую типизацию, улучшая качество кода и продуктивность разработчика.",
    reactDescription:
        "JavaScript библиотека для создания пользовательских интерфейсов, особенно одностраничных приложений с повторно используемыми компонентами.",
    reduxDescription:
        "Библиотека управления состоянием для JavaScript приложений, часто используемая с React для предсказуемых обновлений состояния.",
    tailwindDescription:
        "CSS-фреймворк, ориентированный на утилиты, для быстрого создания пользовательских интерфейсов с предопределенными классами.",
    bootstrapDescription:
        "Популярный CSS-фреймворк для разработки адаптивных и мобильно-ориентированных веб-сайтов с предварительно разработанными компонентами.",
    javaDescription:
        "Объектно-ориентированный язык программирования, используемый для создания корпоративных приложений и разработки под Android.",
    springDescription:
        "Java-фреймворк, который обеспечивает комплексную инфраструктурную поддержку для разработки надежных Java-приложений.",
    postgresDescription:
        "Мощная, открытая объектно-реляционная система баз данных с сильной репутацией в отношении надежности и целостности данных.",
    mongoDescription:
        "NoSQL база данных, которая использует документы, подобные JSON, с опциональными схемами, обеспечивая высокую производительность и масштабируемость.",
    styledComponentsDescription:
        "Библиотека для React, которая позволяет писать CSS в JavaScript, обеспечивая стилизацию на уровне компонентов.",
    figmaDescription:
        "Облачный инструмент дизайна для совместного проектирования интерфейсов, прототипирования и систем дизайна.",
    all: "ВСЕ",
    landing: "Лендинг",
    react: "React",
    spa: "SPA",
    myprojects: "Мои проекты",
    viewProject: "Просмотреть проект",
    demo: "Демо",
    code: "Код",
    counter: "Счетчик",
    counterDescription: "Счетчик с расширенными опциями.",
    userIvan: "иван иванов",
    userPetr: "петр петров",
    userIgor: "игорь игорев",
    contactDescription:
        "Вы можете связаться со мной, просто заполнив форму и нажав кнопку Отправить - и я получу ваше сообщение на свою электронную почту.",
    subject: "Тема",
    email: "Email",
    name: "Имя",
    message: "Сообщение",
    sendMessage: "Отправить сообщение",
    nameRequired: "Имя обязательно",
    invalidEmail: "Неверный адрес электронной почты",
    emailRequired: "Email обязателен",
    subjectRequired: "Тема обязательна",
    messageRequired: "Сообщение обязательно",
};