export const UA = {
    welcome: "Привіт!",
    home: "Головна",
    skills: "Навички",
    project: "Проекти",
    testimony: "Відгуки",
    contacts: "Контакти",
    iam: "Я",
    spec1: "Full Stack розробник.",
    spec2: "Full Stack інженер.",
    spec3: "Розробник програмного забезпечення.",
    spec4: "JAVA розробник.",
    spec5: "Backend розробник.",
    spec6: "Веб-розробник.",
    spec7: "Frontend розробник.",
    spec8: "React розробник.",
    slogan: "Я зараз доступний для працевлаштування",
    redirect: "Перенаправлення через",
    seconds: "секунд...",
    hire: "Найняти мене",
    myskills: "Мої навички",
    htmlDescription:
        "Мова розмітки для створення веб-сторінок та додатків, що забезпечує структуру та вміст веб-сайтів.",
    cssDescription:
        "Мова стилізації, що використовується для контролю презентації та макету HTML-документів, роблячи веб-сайти візуально привабливими.",
    jsDescription:
        "Мова програмування, яка дозволяє створювати інтерактивні веб-сторінки і є важливою частиною веб-додатків.",
    typeScriptDescription:
        "Надбудова JavaScript, яка додає статичну типізацію, покращуючи якість коду та продуктивність розробника.",
    reactDescription:
        "JavaScript бібліотека для створення користувацьких інтерфейсів, особливо односторінкових додатків з компонентами, що можна повторно використовувати.",
    reduxDescription:
        "Бібліотека управління станом для JavaScript додатків, часто використовується з React для передбачуваних оновлень стану.",
    tailwindDescription:
        "CSS-фреймворк, орієнтований на утиліти, для швидкого створення користувацьких інтерфейсів з попередньо визначеними класами.",
    bootstrapDescription:
        "Популярний CSS-фреймворк для розробки адаптивних та мобільно-орієнтованих веб-сайтів з попередньо розробленими компонентами.",
    javaDescription:
        "Об'єктно-орієнтована мова програмування, що використовується для створення корпоративних додатків та розробки під Android.",
    springDescription:
        "Java-фреймворк, який забезпечує комплексну інфраструктурну підтримку для розробки надійних Java-додатків.",
    postgresDescription:
        "Потужна, відкрита об'єктно-реляційна система баз даних з сильною репутацією щодо надійності та цілісності даних.",
    mongoDescription:
        "NoSQL база даних, яка використовує документи, подібні до JSON, з опціональними схемами, що забезпечує високу продуктивність та масштабованість.",
    styledComponentsDescription:
        "Бібліотека для React, яка дозволяє писати CSS в JavaScript, забезпечуючи стилізацію на рівні компонентів.",
    figmaDescription:
        "Хмарний інструмент дизайну для спільного проектування інтерфейсів, прототипування та систем дизайну.",
    all: "ВСІ",
    landing: "Лендінг",
    react: "React",
    spa: "SPA",
    myprojects: "Мої проекти",
    viewProject: "Переглянути проект",
    demo: "Демо",
    code: "Код",
    counter: "Лічильник",
    counterDescription: "Лічильник з розширеними опціями.",
    userIvan: "іван іванов",
    userPetr: "петро петров",
    userIgor: "ігор ігорев",
    contactDescription:
        "Ви можете зв'язатися зі мною, просто заповнивши форму та натиснувши кнопку Надіслати - і я отримаю ваше повідомлення на свою електронну пошту.",
    subject: "Тема",
    email: "Email",
    name: "Ім'я",
    message: "Повідомлення",
    sendMessage: "Надіслати повідомлення",
    nameRequired: "Ім'я обов'язкове",
    invalidEmail: "Невірна адреса електронної пошти",
    emailRequired: "Email обов'язковий",
    subjectRequired: "Тема обов'язкова",
    messageRequired: "Повідомлення обов'язкове",
};